/*
********************************************************************************************************
文件名：main.c
功  能：
备  注：
淘  宝：https://shop60670850.taobao.com
作  者：lilianhe
日  期: 2017-2-6
*********************************************************************************************************
*/

/*
********************************************************************************************************
更新日志：
1.2017-2-8，增加EEPROM测试函数
2.2017-2-8，增加uart测试函数
3.2017-2-8，增加oled测试函数
*********************************************************************************************************
*/
#include "bsp_sys.h"
#include "stdio.h"

/**
  * @brief  主函数
  * @param  无  
  * @retval 无
  */
int main(void)
{	
//***************************设置局部变量***************************//
u16 ADC_BAT_Val,ADC_SYS_Val;
float adc1_B;
float adc2_S;

char adc1_BAT[5];
char adc2_SYS[4];
//*****************************************************************//
	
//*****************************系统初始*****************************//
	
	STM32_System_Init();//所有系统配置在这个函数里完成
	
//*****************************************************************//



		while (1)
		{
			LED_Flash(5);   //循环5次闪一下
			
			ADC_BAT_Val = Get_BAT_ADC();//电压值采集
			ADC_SYS_Val = Get_SYS_ADC();
				Delay_ms(100);	//延时
			//计算电池电压
			adc1_B=ADC_BAT_Val*3.3/4096*11;
			sprintf(adc1_BAT,"%2.1f",adc1_B);
			OLED_ShowString(16,0, adc1_BAT,12);  //OLED显示电池电压

			//计算系统电压
			adc2_S=ADC_SYS_Val*3.3/4096*2;
			sprintf(adc2_SYS,"%2.1f",adc2_S);
			OLED_ShowString(96,0, adc2_SYS,12);  //OLED显示系统电压
		}
		
 
		
	
}	



/*********************************************END OF FILE**********************/
